In [7]:
import pandas as pd

In [8]:
teachers_df = pd.read_csv('kerryrainford.csv')

<h1>Untidy Dataset From Kerry Rainford</h1>

In [9]:
teachers_df

,Teacher_ID,Name,Social_Security_Number,School,Home_Address,Salary
0,1,Jane Doe,123-gh-uh90,112,123 Lane Bronx NY 10485,55555
1,2,Smith Jamie,089-70-8909,Michael J.Quill,123 Lane Bronx NY 10485,66666
2,2,Kay,7898,Malcom X Elementary,657 street,78987

<h2>Deleting the name column from the DataFrame and creating two separate columsn for first and last name</h2>

In [12]:
teachers_df["Last_Name"] = ["Doe", "Smith", "Lin"]
teachers_df["First_Name"] = ["Jane", "Jamie", "Kay"]
del teachers_df["Name"]

,Teacher_ID,Social_Security_Number,School,Home_Address,Salary,Last_Name,First_Name
0,1,123-gh-uh90,112,123 Lane Bronx NY 10485,55555,Doe,Jane
1,2,089-70-8909,Michael J.Quill,123 Lane Bronx NY 10485,66666,Smith,Jamie
2,2,7898,Malcom X Elementary,657 street,78987,Lin,Kay

<h2>Fixing the Teacher_ID column to be unique and to start from 0, and fixing SS number column</h2>

In [16]:
teachers_df["Teacher_ID"] = [num + 1 for num in range(len(teachers_df["Teacher_ID"]))]
teachers_df

,Teacher_ID,Social_Security_Number,School,Home_Address,Salary,Last_Name,First_Name
0,1,123-gh-uh90,112,123 Lane Bronx NY 10485,55555,Doe,Jane
1,2,089-70-8909,Michael J.Quill,123 Lane Bronx NY 10485,66666,Smith,Jamie
2,3,7898,Malcom X Elementary,657 street,78987,Lin,Kay

In [19]:
teachers_df["Social_Security_Number"] = ["123-45-3215", "089-70-8909", "321-65-7898"]
teachers_df

,Teacher_ID,Social_Security_Number,School,Home_Address,Salary,Last_Name,First_Name
0,1,123-45-3215,112,123 Lane Bronx NY 10485,55555,Doe,Jane
1,2,089-70-8909,Michael J.Quill,123 Lane Bronx NY 10485,66666,Smith,Jamie
2,3,321-65-7898,Malcom X Elementary,657 street,78987,Lin,Kay

In [ ]:
teachers_df = teachers_df[["Teacher_ID", "Last_Name", "First_Name", "Social_Security_Number", "School"
                          
                          ]]